<%@ page language="java" contentType="text/html; charset=UTF-8"
	pageEncoding="UTF-8"%>
<%@include file="../../header.jsp"%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>Insert title here</title>
<style>
.radio {
	display: flex;
	align-items: center;
}
.radio label {
	margin-left: 10px;
}
.spacer {
        height: 20px; /* 빈 공간의 높이를 조정할 수 있습니다. */
    }
    #contents {
	padding: 60px;
	background-color: #eff1f0; /*로그인영역 배경*/
}
.joinNoti{
text-align:center;
}
.matter{
color: red;
margin-left: 195px;
}
</style>
</head>
<body>
<!-- 	<main id="contents"> -->
	<div class="container">	
<!-- 	<div class="col-sm-8"> -->
		<h4>회원가입</h4>
		<form class="form-horizontal" role="form" method="post"
			action="javascript:alert( 'success!' );">
			<div class="form-group">
				<label for="provision" class="col-lg-2 control-label">회원가입약관</label>
				<div class="col-lg-10" id="provision">
					<textarea class="form-control" rows="8" style="resize: none">약관동의
제1조(목적) 이 약관은 업체 회사(전자상거래 사업자)가 운영하는 업체 사이버 라라랜드(이하 “라라랜드”이라 한다)에서 제공하는 인터넷 관련 서비스(이하 “서비스”라 한다)를 이용함에 있어 사이버 라라랜드과 이용자의 권리․의무 및 책임사항을 규정함을 목적으로 합니다.
 
  ※「PC통신, 무선 등을 이용하는 전자상거래에 대해서도 그 성질에 반하지 않는 한 이 약관을 준용합니다.」
 
제2조(정의)
 
  ① “라라랜드”이란 업체 회사가 재화 또는 용역(이하 “재화 등”이라 함)을 이용자에게 제공하기 위하여 컴퓨터 등 정보통신설비를 이용하여 재화 등을 거래할 수 있도록 설정한 가상의 영업장을 말하며, 아울러 사이버라라랜드을 운영하는 사업자의 의미로도 사용합니다.
 
  ② “이용자”란 “라라랜드”에 접속하여 이 약관에 따라 “라라랜드”이 제공하는 서비스를 받는 회원 및 비회원을 말합니다.
 
  ③ ‘회원’이라 함은 “라라랜드”에 회원등록을 한 자로서, 계속적으로 “라라랜드”이 제공하는 서비스를 이용할 수 있는 자를 말합니다.
 
  ④ ‘비회원’이라 함은 회원에 가입하지 않고 “라라랜드”이 제공하는 서비스를 이용하는 자를 말합니다.
 
제3조 (약관 등의 명시와 설명 및 개정) 
 
  ① “라라랜드”은 이 약관의 내용과 상호 및 대표자 성명, 영업소 소재지 주소(소비자의 불만을 처리할 수 있는 곳의 주소를 포함), 전화번호․모사전송번호․전자우편주소, 사업자등록번호, 통신판매업 신고번호, 개인정보관리책임자 등을 이용자가 쉽게 알 수 있도록 00 사이버라라랜드의 초기 서비스화면(전면)에 게시합니다. 다만, 약관의 내용은 이용자가 연결화면을 통하여 볼 수 있도록 할 수 있습니다.
 
  ② “라라랜드은 이용자가 약관에 동의하기에 앞서 약관에 정하여져 있는 내용 중 청약철회․배송책임․환불조건 등과 같은 중요한 내용을 이용자가 이해할 수 있도록 별도의 연결화면 또는 팝업화면 등을 제공하여 이용자의 확인을 구하여야 합니다.
 
  ③ “라라랜드”은 「전자상거래 등에서의 소비자보호에 관한 법률」, 「약관의 규제에 관한 법률」, 「전자문서 및 전자거래기본법」, 「전자금융거래법」, 「전자서명법」, 「정보통신망 이용촉진 및 정보보호 등에 관한 법률」, 「방문판매 등에 관한 법률」, 「소비자기본법」 등 관련 법을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.
 
  ④ “라라랜드”이 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 현행약관과 함께 라라랜드의 초기화면에 그 적용일자 7일 이전부터 적용일자 전일까지 공지합니다. 다만, 이용자에게 불리하게 약관내용을 변경하는 경우에는 최소한 30일 이상의 사전 유예기간을 두고 공지합니다.  이 경우 "라라랜드“은 개정 전 내용과 개정 후 내용을 명확하게 비교하여 이용자가 알기 쉽도록 표시합니다. 
 
  ⑤ “라라랜드”이 약관을 개정할 경우에는 그 개정약관은 그 적용일자 이후에 체결되는 계약에만 적용되고 그 이전에 이미 체결된 계약에 대해서는 개정 전의 약관조항이 그대로 적용됩니다. 다만 이미 계약을 체결한 이용자가 개정약관 조항의 적용을 받기를 원하는 뜻을 제3항에 의한 개정약관의 공지기간 내에 “라라랜드”에 송신하여 “라라랜드”의 동의를 받은 경우에는 개정약관 조항이 적용됩니다.
 
  ⑥ 이 약관에서 정하지 아니한 사항과 이 약관의 해석에 관하여는 전자상거래 등에서의 소비자보호에 관한 법률, 약관의 규제 등에 관한 법률, 공정거래위원회가 정하는 「전자상거래 등에서의 소비자 보호지침」 및 관계법령 또는 상관례에 따릅니다.
 
제4조(서비스의 제공 및 변경) 
 
  ① “라라랜드”은 다음과 같은 업무를 수행합니다.
 
    1. 재화 또는 용역에 대한 정보 제공 및 구매계약의 체결
    2. 구매계약이 체결된 재화 또는 용역의 배송
    3. 기타 “라라랜드”이 정하는 업무
 
  ② “라라랜드”은 재화 또는 용역의 품절 또는 기술적 사양의 변경 등의 경우에는 장차 체결되는 계약에 의해 제공할 재화 또는 용역의 내용을 변경할 수 있습니다. 이 경우에는 변경된 재화 또는 용역의 내용 및 제공일자를 명시하여 현재의 재화 또는 용역의 내용을 게시한 곳에 즉시 공지합니다.
 
  ③ “라라랜드”이 제공하기로 이용자와 계약을 체결한 서비스의 내용을 재화 등의 품절 또는 기술적 사양의 변경 등의 사유로 변경할 경우에는 그 사유를 이용자에게 통지 가능한 주소로 즉시 통지합니다.
 
  ④ 전항의 경우 “라라랜드”은 이로 인하여 이용자가 입은 손해를 배상합니다. 다만, “라라랜드”이 고의 또는 과실이 없음을 입증하는 경우에는 그러하지 아니합니다.
 
제5조(서비스의 중단) 
 
  ① “라라랜드”은 컴퓨터 등 정보통신설비의 보수점검․교체 및 고장, 통신의 두절 등의 사유가 발생한 경우에는 서비스의 제공을 일시적으로 중단할 수 있습니다.
 
  ② “라라랜드”은 제1항의 사유로 서비스의 제공이 일시적으로 중단됨으로 인하여 이용자 또는 제3자가 입은 손해에 대하여 배상합니다. 단, “라라랜드”이 고의 또는 과실이 없음을 입증하는 경우에는 그러하지 아니합니다.
 
  ③ 사업종목의 전환, 사업의 포기, 업체 간의 통합 등의 이유로 서비스를 제공할 수 없게 되는 경우에는 “라라랜드”은 제8조에 정한 방법으로 이용자에게 통지하고 당초 “라라랜드”에서 제시한 조건에 따라 소비자에게 보상합니다. 다만, “라라랜드”이 보상기준 등을 고지하지 아니한 경우에는 이용자들의 마일리지 또는 적립금 등을 “라라랜드”에서 통용되는 통화가치에 상응하는 현물 또는 현금으로 이용자에게 지급합니다.
 
제6조(회원가입) 
 
  ① 이용자는 “라라랜드”이 정한 가입 양식에 따라 회원정보를 기입한 후 이 약관에 동의한다는 의사표시를 함으로서 회원가입을 신청합니다.
 
  ② “라라랜드”은 제1항과 같이 회원으로 가입할 것을 신청한 이용자 중 다음 각 호에 해당하지 않는 한 회원으로 등록합니다.
 
    1. 가입신청자가 이 약관 제7조제3항에 의하여 이전에 회원자격을 상실한 적이 있는 경우, 다만 제7조제3항에 의한 회원자격 상실 후 3년이 경과한 자로서 “라라랜드”의 회원재가입 승낙을 얻은 경우에는 예외로 한다.
    2. 등록 내용에 허위, 기재누락, 오기가 있는 경우
    3. 기타 회원으로 등록하는 것이 “라라랜드”의 기술상 현저히 지장이 있다고 판단되는 경우
 
  ③ 회원가입계약의 성립 시기는 “라라랜드”의 승낙이 회원에게 도달한 시점으로 합니다.
 
  ④ 회원은 회원가입 시 등록한 사항에 변경이 있는 경우, 상당한 기간 이내에 “라라랜드”에 대하여 회원정보 수정 등의 방법으로 그 변경사항을 알려야 합니다.
 
제7조(회원 탈퇴 및 자격 상실 등) 
 
  ① 회원은 “라라랜드”에 언제든지 탈퇴를 요청할 수 있으며 “라라랜드”은 즉시 회원탈퇴를 처리합니다.
 
  ② 회원이 다음 각 호의 사유에 해당하는 경우, “라라랜드”은 회원자격을 제한 및 정지시킬 수 있습니다.
 
    1. 가입 신청 시에 허위 내용을 등록한 경우
    2. “라라랜드”을 이용하여 구입한 재화 등의 대금, 기타 “라라랜드”이용에 관련하여 회원이 부담하는 채무를 기일에 지급하지 않는 경우
    3. 다른 사람의 “라라랜드” 이용을 방해하거나 그 정보를 도용하는 등 전자상거래 질서를 위협하는 경우
    4. “라라랜드”을 이용하여 법령 또는 이 약관이 금지하거나 공서양속에 반하는 행위를 하는 경우
 
  ③ “라라랜드”이 회원 자격을 제한․정지 시킨 후, 동일한 행위가 2회 이상 반복되거나 30일 이내에 그 사유가 시정되지 아니하는 경우 “라라랜드”은 회원자격을 상실시킬 수 있습니다.
 
  ④ “라라랜드”이 회원자격을 상실시키는 경우에는 회원등록을 말소합니다. 이 경우 회원에게 이를 통지하고, 회원등록 말소 전에 최소한 30일 이상의 기간을 정하여 소명할 기회를 부여합니다.
 
제8조(회원에 대한 통지)
 
  ① “라라랜드”이 회원에 대한 통지를 하는 경우, 회원이 “라라랜드”과 미리 약정하여 지정한 전자우편 주소로 할 수 있습니다.
 
  ② “라라랜드”은 불특정다수 회원에 대한 통지의 경우 1주일이상 “라라랜드” 게시판에 게시함으로서 개별 통지에 갈음할 수 있습니다. 다만, 회원 본인의 거래와 관련하여 중대한 영향을 미치는 사항에 대하여는 개별통지를 합니다.
 
제9조(구매신청) 
 
  ① “라라랜드”이용자는 “라라랜드”상에서 다음 또는 이와 유사한 방법에 의하여 구매를 신청하며, “라라랜드”은 이용자가 구매신청을 함에 있어서 다음의 각 내용을 알기 쉽게 제공하여야 합니다.
      1. 재화 등의 검색 및 선택
      2. 받는 사람의 성명, 주소, 전화번호, 전자우편주소(또는 이동전화번호) 등의 입력
      3. 약관내용, 청약철회권이 제한되는 서비스, 배송료․설치비 등의 비용부담과 관련한 내용에 대한 확인
      4. 이 약관에 동의하고 위 3.호의 사항을 확인하거나 거부하는 표시
         (예, 마우스 클릭)
      5. 재화 등의 구매신청 및 이에 관한 확인 또는 “라라랜드”의 확인에 대한 동의
      6. 결제방법의 선택
 
  ② “라라랜드”이 제3자에게 구매자 개인정보를 제공·위탁할 필요가 있는 경우 실제 구매신청 시 구매자의 동의를 받아야 하며, 회원가입 시 미리 포괄적으로 동의를 받지 않습니다. 이 때 “라라랜드”은 제공되는 개인정보 항목, 제공받는 자, 제공받는 자의 개인정보 이용 목적 및 보유‧이용 기간 등을 구매자에게 명시하여야 합니다. 다만 「정보통신망이용촉진 및 정보보호 등에 관한 법률」 제25조 제1항에 의한 개인정보 취급위탁의 경우 등 관련 법령에 달리 정함이 있는 경우에는 그에 따릅니다.
 
 
제10조 (계약의 성립)
 
  ①  “라라랜드”은 제9조와 같은 구매신청에 대하여 다음 각 호에 해당하면 승낙하지 않을 수 있습니다. 다만, 미성년자와 계약을 체결하는 경우에는 법정대리인의 동의를 얻지 못하면 미성년자 본인 또는 법정대리인이 계약을 취소할 수 있다는 내용을 고지하여야 합니다.
 
    1. 신청 내용에 허위, 기재누락, 오기가 있는 경우
    2. 미성년자가 담배, 주류 등 청소년보호법에서 금지하는 재화 및 용역을 구매하는 경우
    3. 기타 구매신청에 승낙하는 것이 “라라랜드” 기술상 현저히 지장이 있다고 판단하는 경우
 
  ② “라라랜드”의 승낙이 제12조제1항의 수신확인통지형태로 이용자에게 도달한 시점에 계약이 성립한 것으로 봅니다.
 
  ③ “라라랜드”의 승낙의 의사표시에는 이용자의 구매 신청에 대한 확인 및 판매가능 여부, 구매신청의 정정 취소 등에 관한 정보 등을 포함하여야 합니다.
 
제11조(지급방법) “라라랜드”에서 구매한 재화 또는 용역에 대한 대금지급방법은 다음 각 호의 방법중 가용한 방법으로 할 수 있습니다. 단, “라라랜드”은 이용자의 지급방법에 대하여 재화 등의 대금에 어떠한 명목의 수수료도  추가하여 징수할 수 없습니다.
 
    1. 폰뱅킹, 인터넷뱅킹, 메일 뱅킹 등의 각종 계좌이체 
    2. 선불카드, 직불카드, 신용카드 등의 각종 카드 결제
    3. 온라인무통장입금
    4. 전자화폐에 의한 결제
    5. 수령 시 대금지급
    6. 마일리지 등 “라라랜드”이 지급한 포인트에 의한 결제
    7. “라라랜드”과 계약을 맺었거나 “라라랜드”이 인정한 상품권에 의한 결제  
    8. 기타 전자적 지급 방법에 의한 대금 지급 등
 
제12조(수신확인통지․구매신청 변경 및 취소)
 
  ① “라라랜드”은 이용자의 구매신청이 있는 경우 이용자에게 수신확인통지를 합니다.
 
  ② 수신확인통지를 받은 이용자는 의사표시의 불일치 등이 있는 경우에는 수신확인통지를 받은 후 즉시 구매신청 변경 및 취소를 요청할 수 있고 “라라랜드”은 배송 전에 이용자의 요청이 있는 경우에는 지체 없이 그 요청에 따라 처리하여야 합니다. 다만 이미 대금을 지불한 경우에는 제15조의 청약철회 등에 관한 규정에 따릅니다.
 
제13조(재화 등의 공급)
 
  ① “라라랜드”은 이용자와 재화 등의 공급시기에 관하여 별도의 약정이 없는 이상, 이용자가 청약을 한 날부터 7일 이내에 재화 등을 배송할 수 있도록 주문제작, 포장 등 기타의 필요한 조치를 취합니다. 다만, “라라랜드”이 이미 재화 등의 대금의 전부 또는 일부를 받은 경우에는 대금의 전부 또는 일부를 받은 날부터 3영업일 이내에 조치를 취합니다.  이때 “라라랜드”은 이용자가 재화 등의 공급 절차 및 진행 사항을 확인할 수 있도록 적절한 조치를 합니다.
 
  ② “라라랜드”은 이용자가 구매한 재화에 대해 배송수단, 수단별 배송비용 부담자, 수단별 배송기간 등을 명시합니다. 만약 “라라랜드”이 약정 배송기간을 초과한 경우에는 그로 인한 이용자의 손해를 배상하여야 합니다. 다만 “라라랜드”이 고의․과실이 없음을 입증한 경우에는 그러하지 아니합니다.
 
제14조(환급) “라라랜드”은 이용자가 구매신청한 재화 등이 품절 등의 사유로 인도 또는 제공을 할 수 없을 때에는 지체 없이 그 사유를 이용자에게 통지하고 사전에 재화 등의 대금을 받은 경우에는 대금을 받은 날부터 3영업일 이내에 환급하거나 환급에 필요한 조치를 취합니다.
 
제15조(청약철회 등)
 
  ① “라라랜드”과 재화등의 구매에 관한 계약을 체결한 이용자는 「전자상거래 등에서의 소비자보호에 관한 법률」 제13조 제2항에 따른 계약내용에 관한 서면을 받은 날(그 서면을 받은 때보다 재화 등의 공급이 늦게 이루어진 경우에는 재화 등을 공급받거나 재화 등의 공급이 시작된 날을 말합니다)부터 7일 이내에는 청약의 철회를 할 수 있습니다. 다만, 청약철회에 관하여 「전자상거래 등에서의 소비자보호에 관한 법률」에 달리 정함이 있는 경우에는 동 법 규정에 따릅니다. 
 
  ② 이용자는 재화 등을 배송 받은 경우 다음 각 호의 1에 해당하는 경우에는 반품 및 교환을 할 수 없습니다.
 
    1. 이용자에게 책임 있는 사유로 재화 등이 멸실 또는 훼손된 경우(다만, 재화 등의 내용을 확인하기 위하여 포장 등을 훼손한 경우에는 청약철회를 할 수 있습니다)
    2. 이용자의 사용 또는 일부 소비에 의하여 재화 등의 가치가 현저히 감소한 경우
    3. 시간의 경과에 의하여 재판매가 곤란할 정도로 재화등의 가치가 현저히 감소한 경우
    4. 같은 성능을 지닌 재화 등으로 복제가 가능한 경우 그 원본인 재화 등의 포장을 훼손한 경우
 
  ③ 제2항제2호 내지 제4호의 경우에 “라라랜드”이 사전에 청약철회 등이 제한되는 사실을 소비자가 쉽게 알 수 있는 곳에 명기하거나 시용상품을 제공하는 등의 조치를 하지 않았다면 이용자의 청약철회 등이 제한되지 않습니다.
 
  ④ 이용자는 제1항 및 제2항의 규정에 불구하고 재화 등의 내용이 표시·광고 내용과 다르거나 계약내용과 다르게 이행된 때에는 당해 재화 등을 공급받은 날부터 3월 이내, 그 사실을 안 날 또는 알 수 있었던 날부터 30일 이내에 청약철회 등을 할 수 있습니다.
 
제16조(청약철회 등의 효과)
 
  ① “라라랜드”은 이용자로부터 재화 등을 반환받은 경우 3영업일 이내에 이미 지급받은 재화 등의 대금을 환급합니다. 이 경우 “라라랜드”이 이용자에게 재화등의 환급을 지연한때에는 그 지연기간에 대하여 「전자상거래 등에서의 소비자보호에 관한 법률 시행령」제21조의2에서 정하는 지연이자율을 곱하여 산정한 지연이자를 지급합니다.
 
  ② “라라랜드”은 위 대금을 환급함에 있어서 이용자가 신용카드 또는 전자화폐 등의 결제수단으로 재화 등의 대금을 지급한 때에는 지체 없이 당해 결제수단을 제공한 사업자로 하여금 재화 등의 대금의 청구를 정지 또는 취소하도록 요청합니다.
 
  ③ 청약철회 등의 경우 공급받은 재화 등의 반환에 필요한 비용은 이용자가 부담합니다. “라라랜드”은 이용자에게 청약철회 등을 이유로 위약금 또는 손해배상을 청구하지 않습니다. 다만 재화 등의 내용이 표시·광고 내용과 다르거나 계약내용과 다르게 이행되어 청약철회 등을 하는 경우 재화 등의 반환에 필요한 비용은 “라라랜드”이 부담합니다.
 
  ④ 이용자가 재화 등을 제공받을 때 발송비를 부담한 경우에 “라라랜드”은 청약철회 시 그 비용을  누가 부담하는지를 이용자가 알기 쉽도록 명확하게 표시합니다.
 
제17조(개인정보보호)
 
  ① “라라랜드”은 이용자의 개인정보 수집시 서비스제공을 위하여 필요한 범위에서 최소한의 개인정보를 수집합니다. 
 
  ② “라라랜드”은 회원가입시 구매계약이행에 필요한 정보를 미리 수집하지 않습니다. 다만, 관련 법령상 의무이행을 위하여 구매계약 이전에 본인확인이 필요한 경우로서 최소한의 특정 개인정보를 수집하는 경우에는 그러하지 아니합니다.
 
  ③ “라라랜드”은 이용자의 개인정보를 수집·이용하는 때에는 당해 이용자에게 그 목적을 고지하고 동의를 받습니다. 
 
  ④ “라라랜드”은 수집된 개인정보를 목적외의 용도로 이용할 수 없으며, 새로운 이용목적이 발생한 경우 또는 제3자에게 제공하는 경우에는 이용·제공단계에서 당해 이용자에게 그 목적을 고지하고 동의를 받습니다. 다만, 관련 법령에 달리 정함이 있는 경우에는 예외로 합니다.
 
  ⑤ “라라랜드”이 제3항과 제4항에 의해 이용자의 동의를 받아야 하는 경우에는 개인정보관리 책임자의 신원(소속, 성명 및 전화번호, 기타 연락처), 정보의 수집목적 및 이용목적, 제3자에 대한 정보제공 관련사항(제공받은자, 제공목적 및 제공할 정보의 내용) 등 「정보통신망 이용촉진 및 정보보호 등에 관한 법률」 제22조제2항이 규정한 사항을 미리 명시하거나 고지해야 하며 이용자는 언제든지 이 동의를 철회할 수 있습니다.
 
  ⑥ 이용자는 언제든지 “라라랜드”이 가지고 있는 자신의 개인정보에 대해 열람 및 오류정정을 요구할 수 있으며 “라라랜드”은 이에 대해 지체 없이 필요한 조치를 취할 의무를 집니다. 이용자가 오류의 정정을 요구한 경우에는 “라라랜드”은 그 오류를 정정할 때까지 당해 개인정보를 이용하지 않습니다.
 
  ⑦ “라라랜드”은 개인정보 보호를 위하여 이용자의 개인정보를 취급하는 자를  최소한으로 제한하여야 하며 신용카드, 은행계좌 등을 포함한 이용자의 개인정보의 분실, 도난, 유출, 동의 없는 제3자 제공, 변조 등으로 인한 이용자의 손해에 대하여 모든 책임을 집니다.
 
  ⑧ “라라랜드” 또는 그로부터 개인정보를 제공받은 제3자는 개인정보의 수집목적 또는 제공받은 목적을 달성한 때에는 당해 개인정보를 지체 없이 파기합니다.
 
  ⑨ “라라랜드”은 개인정보의 수집·이용·제공에 관한 동의란을 미리 선택한 것으로 설정해두지 않습니다. 또한 개인정보의 수집·이용·제공에 관한 이용자의 동의거절시 제한되는 서비스를 구체적으로 명시하고, 필수수집항목이 아닌 개인정보의 수집·이용·제공에 관한 이용자의 동의 거절을 이유로 회원가입 등 서비스 제공을 제한하거나 거절하지 않습니다.
 
제18조(“라라랜드“의 의무)
 
  ① “라라랜드”은 법령과 이 약관이 금지하거나 공서양속에 반하는 행위를 하지 않으며 이 약관이 정하는 바에 따라 지속적이고, 안정적으로 재화․용역을 제공하는데 최선을 다하여야 합니다.
 
  ② “라라랜드”은 이용자가 안전하게 인터넷 서비스를 이용할 수 있도록 이용자의 개인정보(신용정보 포함)보호를 위한 보안 시스템을 갖추어야 합니다.
 
  ③ “라라랜드”이 상품이나 용역에 대하여 「표시․광고의 공정화에 관한 법률」 제3조 소정의 부당한 표시․광고행위를 함으로써 이용자가 손해를 입은 때에는 이를 배상할 책임을 집니다.
 
  ④ “라라랜드”은 이용자가 원하지 않는 영리목적의 광고성 전자우편을 발송하지 않습니다.
 
제19조(회원의 ID 및 비밀번호에 대한 의무)
 
  ① 제17조의 경우를 제외한 ID와 비밀번호에 관한 관리책임은 회원에게 있습니다.
 
  ② 회원은 자신의 ID 및 비밀번호를 제3자에게 이용하게 해서는 안됩니다.
 
  ③ 회원이 자신의 ID 및 비밀번호를 도난당하거나 제3자가 사용하고 있음을 인지한 경우에는 바로 “라라랜드”에 통보하고 “라라랜드”의 안내가 있는 경우에는 그에 따라야 합니다.
 
제20조(이용자의 의무) 이용자는 다음 행위를 하여서는 안 됩니다.
 
    1. 신청 또는 변경시 허위 내용의 등록
    2. 타인의 정보 도용
    3. “라라랜드”에 게시된 정보의 변경
    4. “라라랜드”이 정한 정보 이외의 정보(컴퓨터 프로그램 등) 등의 송신 또는 게시
    5. “라라랜드” 기타 제3자의 저작권 등 지적재산권에 대한 침해
    6. “라라랜드” 기타 제3자의 명예를 손상시키거나 업무를 방해하는 행위
    7. 외설 또는 폭력적인 메시지, 화상, 음성, 기타 공서양속에 반하는 정보를 라라랜드에 공개 또는 게시하는 행위
 
제21조(연결“라라랜드”과 피연결“라라랜드” 간의 관계)
 
  ① 상위 “라라랜드”과 하위 “라라랜드”이 하이퍼링크(예: 하이퍼링크의 대상에는 문자, 그림 및 동화상 등이 포함됨)방식 등으로 연결된 경우, 전자를 연결 “라라랜드”(웹 사이트)이라고 하고 후자를 피연결 “라라랜드”(웹사이트)이라고 합니다.
 
  ② 연결“라라랜드”은 피연결“라라랜드”이 독자적으로 제공하는 재화 등에 의하여 이용자와 행하는 거래에 대해서 보증 책임을 지지 않는다는 뜻을 연결“라라랜드”의 초기화면 또는 연결되는 시점의 팝업화면으로 명시한 경우에는 그 거래에 대한 보증 책임을 지지 않습니다.
 
제22조(저작권의 귀속 및 이용제한)
 
  ① “라라랜드“이 작성한 저작물에 대한 저작권 기타 지적재산권은 ”라라랜드“에 귀속합니다.
 
  ② 이용자는 “라라랜드”을 이용함으로써 얻은 정보 중 “라라랜드”에게 지적재산권이 귀속된 정보를 “라라랜드”의 사전 승낙 없이 복제, 송신, 출판, 배포, 방송 기타 방법에 의하여 영리목적으로 이용하거나 제3자에게 이용하게 하여서는 안됩니다.
 
  ③ “라라랜드”은 약정에 따라 이용자에게 귀속된 저작권을 사용하는 경우 당해 이용자에게 통보하여야 합니다.
 
제23조(분쟁해결)
 
  ① “라라랜드”은 이용자가 제기하는 정당한 의견이나 불만을 반영하고 그 피해를 보상처리하기 위하여 피해보상처리기구를 설치․운영합니다.
 
  ② “라라랜드”은 이용자로부터 제출되는 불만사항 및 의견은 우선적으로 그 사항을 처리합니다. 다만, 신속한 처리가 곤란한 경우에는 이용자에게 그 사유와 처리일정을 즉시 통보해 드립니다.
 
  ③ “라라랜드”과 이용자 간에 발생한 전자상거래 분쟁과 관련하여 이용자의 피해구제신청이 있는 경우에는 공정거래위원회 또는 시·도지사가 의뢰하는 분쟁조정기관의 조정에 따를 수 있습니다.
 
제24조(재판권 및 준거법)
 
  ① “라라랜드”과 이용자 간에 발생한 전자상거래 분쟁에 관한 소송은 제소 당시의 이용자의 주소에 의하고, 주소가 없는 경우에는 거소를 관할하는 지방법원의 전속관할로 합니다. 다만, 제소 당시 이용자의 주소 또는 거소가 분명하지 않거나 외국 거주자의 경우에는 민사소송법상의 관할법원에 제기합니다.
 
  ② “라라랜드”과 이용자 간에 제기된 전자상거래 소송에는 한국법을 적용합니다.
 
                        </textarea>

					<div class="radio">
						<label> <input type="radio" id="provisionYnYes"
							name="provisionYn" value="y" checked
							onchange="handleRadioChange(this)"> 동의합니다.
						</label>
					</div>
					<div class="radio">
						<label> <input type="radio" id="provisionYnNo"
							name="provisionYn" value="n" onchange="handleRadioChange(this)">
							동의하지 않습니다.
						</label>
					</div>
				</div>
			</div>
			<div class="form-group">
				<label for="memberInfo" class="col-lg-2 control-label">개인정보취급방침</label>
				<div class="col-lg-10" id="memberInfo">
					<textarea class="form-control" rows="8" style="resize: none">개인정보의 항목 및 수집방법
1. 개인정보의 처리 목적

<(주)lalaland>(‘www.lalaland.com’이하 ‘라라랜드’) 은 다음의 목적을 위하여 개인정보를 처리하고 있으며, 다음의 목적 이외의 용도로는 이용하지 않습니다.
– 고객 가입의사 확인, 고객에 대한 서비스 제공에 따른 본인 식별.인증, 회원자격 유지.관리, 물품 또는 서비스 공급에 따른 금액 결제, 물품 또는 서비스의 공급.배송 등

2. 개인정보의 처리 및 보유 기간

① ‘라라랜드’는 정보주체로부터 개인정보를 수집할 때 동의 받은 개인정보 보유․이용기간 또는 법령에 따른 개인정보 보유․이용기간 내에서 개인정보를 처리․보유합니다.

② 구체적인 개인정보 처리 및 보유 기간은 다음과 같습니다.
– 고객 가입 및 관리 : 카카오싱크를 통한 회원가입 및 카카오채널을 통한 관리
– 보유 기간 : 카카오채널 탈퇴 시, 즉시 삭제

3. 정보주체와 법정대리인의 권리·의무 및 그 행사방법 이용자는 개인정보주체로써 다음과 같은 권리를 행사할 수 있습니다.

① 정보주체는 ‘라라랜드’ 에 대해 언제든지 다음 각 호의 개인정보 보호 관련 권리를 행사할 수 있습니다.
1. 개인정보 열람요구
2. 오류 등이 있을 경우 정정 요구
3. 삭제요구
4. 처리정지 요구

4. 처리하는 개인정보의 항목 작성

① ‘라라랜드’는 다음의 개인정보 항목을 처리하고 있습니다.

<‘라라랜드’에서 수집하는 개인정보 항목>
‘라라랜드’ 회원 가입 및 고객 문의 시, 제공 동의를 해주시는 개인정보 수집 항목입니다.

■ 회원 가입 시(회원)
– 필수항목 : 이름, 이메일, 전화번호, 성별, 연령대
– 선택항목 : 생년월일
– 수집목적 : 라라랜드 회원관리 및 마케팅 이용
– 보유기간 : 회원 탈퇴 또는 동의철회 시 지체없이 파기

■ 고객 문의 시(비회원)
– 필수항목 : 문의종류, 이름, 휴대폰번호, 이메일, 문의사항
– 수집목적 : 고객문의 및 상담요청에 대한 회신, 상담을 위한 서비스 이용기록 조회
– 보유기간 : 문의 접수 후 2년 간 보관 (단, 관계 법령이 정한 시점까지 보존)

<카카오 개인정보 제3자 제공 동의>
아래는 ‘라라랜드’ 회원 가입 시(카카오 계정을 통한 간편 가입시) 제공 동의를 해주시는 자동 수집 항목입니다.

– 필수항목 : 프로필 정보(닉네임/프로필 사진), 카카오계정(이메일), 카카오계정(전화번호), 성별, 연령대, 카카오톡 채널 추가 상태 및 내역
– 선택항목 : 생일, 출생연도
– 수집목적 : 라라랜드 카카오채널을 통한 회원관리 및 마케팅 이용
– 보유기간 : 카카오채널 탈퇴 또는 동의철회 시 지체없이 파기

② ‘라라랜드’는 만 14세 미만 아동의 개인정보를 보호하기 위하여 회원가입은 만14세 이상만 가능하도록 함으로써 아동의 개인정보를 수집하지 않습니다.

5. 개인정보의 파기

‘라라랜드’은 원칙적으로 개인정보 처리목적이 달성된 경우에는 지체없이 해당 개인정보를 파기합니다. 파기의 절차, 기한 및 방법은 다음과 같습니다.’

-파기절차
이용자가 입력한 정보는 목적 달성 후 별도의 DB에 옮겨져(종이의 경우 별도의 서류) 내부 방침 및 기타 관련 법령에 따라 일정기간 저장된 후 혹은 즉시 파기됩니다. 이 때, DB로 옮겨진 개인정보는 법률에 의한 경우가 아니고서는 다른 목적으로 이용되지 않습니다.

-파기기한
이용자의 개인정보는 개인정보의 보유기간이 경과된 경우에는 보유기간의 종료일로부터 5일 이내에, 개인정보의 처리 목적 달성, 해당 서비스의 폐지, 사업의 종료 등 그 개인정보가 불필요하게 되었을 때에는 개인정보의 처리가 불필요한 것으로 인정되는 날로부터 5일 이내에 그 개인정보를 파기합니다.

6. 개인정보 자동 수집 장치의 설치•운영 및 거부에 관한 사항

① ‘라라랜드’는 개별적인 맞춤서비스를 제공하기 위해 이용정보를 저장하고 수시로 불러오는 ‘쿠키(cookie)’를 사용합니다.

② 쿠키는 웹사이트를 운영하는데 이용되는 서버(https)가 이용자의 컴퓨터 브라우저에게 보내는 소량의 정보이며 이용자들의 PC 컴퓨터내의 하드디스크에 저장되기도 합니다.

가. 쿠키의 사용 목적 : 이용자가 방문한 각 서비스와 웹 사이트들에 대한 방문 및 이용형태, 인기 검색어, 보안접속 여부, 등을 파악하여 이용자에게 최적화된 정보 제공을 위해 사용됩니다.
나. 쿠키의 설치•운영 및 거부 : 웹브라우저 상단의 도구>인터넷 옵션>개인정보 메뉴의 옵션 설정을 통해 쿠키 저장을 거부 할 수 있습니다.
다. 쿠키 저장을 거부할 경우 맞춤형 서비스 이용에 어려움이 발생할 수 있습니다.
7. 개인정보 보호책임자 작성

① ‘라라랜드’는 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와 관련한 정보주체의 불만처리 및 피해구제 등을 위하여 아래와 같이 개인정보 보호책임자를 지정하고 있습니다.

▶ 개인정보 보호책임자
성명 : 이라라
직책 : 대표
직급 : CEO
연락처 : 1577-8725, contact@jpinnovation.kr
※ 개인정보 보호 담당부서로 연결됩니다.

▶ 개인정보 보호 담당부서
부서명 : 마케팅팀
담당자 : 김라라
연락처 : 1577-8725, amykwak@jpinnovation.kr


② ‘라라랜드’의 서비스(또는 사업)을 이용하시면서 발생한 모든 개인정보 보호 관련 문의, 불만처리, 피해구제 등에 관한 사항을 개인정보 보호책임자 및 담당부서로 문의하실 수 있습니다.

‘라라랜드’는 정보주체의 문의에 대해 지체 없이 답변 및 처리해드릴 것입니다.

8. 개인정보 처리방침 변경

① 이 개인정보처리방침은 시행일로부터 적용되며, 법령 및 방침에 따른 변경내용의 추가, 삭제 및 정정이 있는 경우에는 변경사항의 시행 7일 전부터 공지사항을 통하여 고지할 것입니다.

9. 개인정보의 안전성 확보 조치 
‘라라랜드’는 개인정보보호법 제29조에 따라 다음과 같이 안전성 확보에 필요한 기술적/관리적 및 물리적 조치를 하고 있습니다.

① 개인정보 취급 직원의 최소화 및 교육
개인정보를 취급하는 직원을 지정하고 담당자에 한정시켜 최소화 하여 개인정보를 관리하는 대책을 시행하고 있습니다.


② 해킹 등에 대비한 기술적 대책
‘라라랜드’는 해킹이나 컴퓨터 바이러스 등에 의한 개인정보 유출 및 훼손을 막기 위하여 보안프로그램을 설치하고 주기적인 갱신·점검을 하며 외부로부터 접근이 통제된 구역에 시스템을 설치하고 기술적/물리적으로 감시 및 차단하고 있습니다.


③ 개인정보의 암호화
이용자의 개인정보는 비밀번호는 암호화 되어 저장 및 관리되고 있어, 본인만이 알 수 있으며 중요한 데이터는 파일 및 전송 데이터를 암호화 하거나 파일 잠금 기능을 사용하는 등의 별도 보안기능을 사용하고 있습니다.


④ 접속기록의 보관 및 위변조 방지
개인정보처리시스템에 접속한 기록을 최소 6개월 이상 보관, 관리하고 있으며, 접속 기록이 위변조 및 도난, 분실되지 않도록 보안기능 사용하고 있습니다.


⑤ 개인정보에 대한 접근 제한
개인정보를 처리하는 데이터베이스시스템에 대한 접근권한의 부여,변경,말소를 통하여 개인정보에 대한 접근통제를 위하여 필요한 조치를 하고 있으며 침입차단시스템을 이용하여 외부로부터의 무단 접근을 통제하고 있습니다.


10. 정보주체의 권익침해에 대한 구제방법

아래의 기관은 (주)lalaland과는 별개의 기관으로서, ‘라라랜드’는 자체적인 개인정보 불만처리, 피해구제 결과에 만족하지 못하시거나 보다 자세한 도움이 필요하시면 문의하여 주시기 바랍니다.

▶ 개인정보 침해신고센터 (한국인터넷진흥원 운영)
– 소관업무 : 개인정보 침해사실 신고, 상담 신청
– 홈페이지 : privacy.kisa.or.kr
– 전화 : (국번없이) 118
– 주소 : (58324) 전남 나주시 진흥길 9(빛가람동 301-2) 3층 개인정보침해신고센터


▶ 개인정보 분쟁조정위원회
– 소관업무 : 개인정보 분쟁조정신청, 집단분쟁조정 (민사적 해결)
– 홈페이지 : www.kopico.go.kr
– 전화 : (국번없이) 1833-6972
– 주소 : (03171)서울특별시 종로구 세종대로 209 정부서울청사 4층


▶ 대검찰청 사이버범죄수사단 : 02-3480-3573 (www.spo.go.kr)


▶ 경찰청 사이버안전국 : 182 (http://cyberbureau.police.go.kr)
                        </textarea>
					<div class="radio">
						<label> <input type="radio" id="memberInfoYnYes"
							name="memberInfoYn" value="y" checked
							onchange="handleRadioChange(this)"> 동의합니다.
						</label>
					</div>
					<div class="radio">
						<label> <input type="radio" id="memberInfoYnNo"
							name="memberInfoYn" value="n" onchange="handleRadioChange(this)">
							동의하지 않습니다.
						</label>
					</div>
					<div class="joinNoti">
						<label>* 모든 약관을 동의해야 가입이 진행됩니다.</label>
					</div>
				</div>
			</div>
		</form>

		<hr>
		<!-- action속성이 생략되어진 상태 : 생략되었을 때 나 자신(join.jsp)페이지로 되돌아 옴 -->
		<form class="form-horizontal" method="post" onsubmit="valid()">
			<div class="form-group">
				<label for="id" class="control-label col-sm-2">아이디<span
					class="rq"> *</span></label> <span class="sp"></span>
				<div class="col-sm-4">
					<input type="text" class="form-control" id="id" name="mem_id"
						placeholder="Enter id" required pattern="[a-zA-Z][a-zA-Z0-9]{3,7}">
					<!-- 첫자리는 영문자만, 나머지는 영문자와 숫자만 3~7자리 => 총 4~8자리 -->
				</div>
				<div class="col-sm-6" style="text-align: left;">
					<!--             <button type="button" class="btn btn-success btn-sm" id="idChk">중복검사</button> -->
					<span id="disp"></span>
				</div>
			</div>
<h6 class="matter">3~7글자 사이에서 첫자리는 영문자만, 나머지는 영문자와 숫자를 포함해 입력해주세요</h6>
			<div class="form-group">
				<label for="pass" class="control-label col-sm-2">비밀번호<span
					class="rq"> *</span></label>
				<div class="col-sm-4">
					<input type="text" class="form-control" id="pass" name="mem_pw"
						required pattern="(?=.*[a-zA-Z])((?=.*\d)|(?=.*\W)).{6,20}">
					<!-- 	        required pattern="(?=.*[a-z])(?=.*[A-Z])(?=.*[0-9])(?=.*[!@#$%^&*()]).{2,5}"> -->
					<!-- 대소영문, 숫자, 영문자와숫자가 아닌 모든 문자가 6~20자 인 패턴 -->

					<!-- 임의의 문자(.)를 대상으로 최소갯수(*,?)의 지정 패턴을 찾아라 -->
					<!-- ?= 전방탐색 - 일치영역을 찾고 값은 반환하지 않는 패턴 =(equal)다음 일치하는 패턴을 찾음 -->
					<!-- * 0개 이상 반복 / + 1개 이상 반복 / ? 0또는1개 이상 반복 -->
				</div>
			</div>
			<h6 class="matter">6~20글자 사이의 알파벳, 숫자, 특수문자(!@#$%^&*())를 포함해 입력해주세요</h6>
			<div class="form-group">
				<label for="name" class="control-label col-sm-2">이름<span
					class="rq"> *</span></label> <span class="sp"></span>
				<div class="col-sm-4">
					<input type="text" class="form-control" id="name" name="mem_name"
						required pattern="[가-힣]{2,5}">
				</div>
			</div>

			<div class="form-group">
				<label for="bir" class="control-label col-sm-2">생년월일 *</label>
				<div class="col-sm-4">
					<input type="date" class="form-control" id="bir" name="mem_birth">
				</div>
			</div>

			<div class="form-group">
				<label for="hp" class="control-label col-sm-2">연락처<span
					class="rq"> *</span></label>
				<div class="col-sm-4">
					<input type="text" class="form-control" id="hp" name="mem_tel"
						placeholder="010-0000-0000" required
						pattern="[0-9]{2,3}-[0-9]{3,4}-[0-9]{4}">
				</div>
			</div>

			<div class="form-group">
				<label for="mail" class="control-label col-sm-2">이메일<span
					class="rq"> *</span></label>
				<div class="col-sm-4">
					<input type="email" class="form-control" id="mail" name="mem_email"
						pattern="[0-9a-zA-Z]+@[0-9a-zA-Z]+(\.[a-z]+){1,2}">
					<!-- 영문숫자조합의 문자가 최소 1회 반복, @발생, 문자 최소 1회 반복
        dot으로 시작하는 영문자 1~2회 발생 -->
				</div>
				<div class="col-sm-2" style="display: flex; align-items: center;">
					<label class="form-check-label" for="check1">이메일 수신여부</label>
					<div class="col-sm-2" style="display: flex; align-items: center;">
<input class="form-check-input" type="checkbox" id="checkYn" onchange="YnCheck(this);" name="mem_noti" checked>

					</div>
				</div>
			</div>

			<div class="form-group">
				<label for="add1" class="control-label col-sm-2">우편번호<span
					class="rq"> </span></label>
				<div class="col-sm-4">
					<input type="text" class="form-control" id="postAddr"
						name="mem_zip" required>
				</div>
				<div class="col-sm-2">
					<button type="button" id="addrBtn" class="btn btn-info btn-sm">주소검색</button>
				</div>
			</div>

			<div class="form-group">
				<label for="add1" class="control-label col-sm-2">주소<span
					class="rq"> </span></label>
				<div class="col-sm-6">
					<input type="text" class="form-control" id="addr1" name="mem_add"
						required>
				</div>
			</div>

			<div class="form-group">
				<label for="add2" class="control-label col-sm-2">상세주소<span
					class="rq"> </span></label>
				<div class="col-sm-6">
					<input type="text" class="form-control" id="addr2" name="mem_dadd"
						required>
				</div>
			</div>

			<div class="col-sm-offset-2 col-sm-6">
				<button id="joinBtn" style="margin-left:400px;margin-bottom:20px;" class="btn btn-default" disabled>가입하기</button>
				<span id="joinspan"></span>
				<div class="spacer"></div> <!-- 빈 공간을 만들기 위한 spacer 클래스 -->
			</div>
		</form>
<!-- 	</div> -->
<!-- 	</main> -->
	</div>
	
	<script
		src="//t1.daumcdn.net/mapjsapi/bundle/postcode/prod/postcode.v2.js"></script>
	<script>
		$('#id').on('keyup', function() {
			// 	$('#idChk').on('click',function(){});

			let idVal = $('#id').val();

			//AJAX로 ID중복검사 결과 얻기
			$.ajax({
				type : 'post',
				url : '<%=request.getContextPath()%>/views/login/idChk.jsp',
				data : {
					uId : idVal
				}, //post, 제이쿼리는 객체의 형태도 urlencode형식(key=value)으로 자동변환하여 넘김
				success : function(rst) {
					if (rst.rst == "ok") {
						$('#disp').text(rst.msg).css('color', 'green');
					} else {
						$('#disp').text(rst.msg).css('color', 'red');
					}
				},
				error : function(xhr) {
					alert(xhr.status);
				},
				dataType : 'json' //제이쿼리는 넘어오는 데이터 타입에 맞게 자동 형변환해주므로 생략가능
			});
		});

		//주소검색 버튼을 눌렀을 때 sample4_execDaumPostcode함수를 실행하자
		$('#addrBtn').on('click', sample4_execDaumPostcode);

		//다음 주소록 api
		function sample4_execDaumPostcode() {
			new daum.Postcode({
				oncomplete : function(data) {
					// 팝업에서 검색결과 항목을 클릭했을때 실행할 코드를 작성하는 부분.

					// 도로명 주소의 노출 규칙에 따라 주소를 표시한다.
					// 내려오는 변수가 값이 없는 경우엔 공백('')값을 가지므로, 이를 참고하여 분기 한다.
					var roadAddr = data.roadAddress; // 도로명 주소 변수

					// 우편번호와 주소 정보를 해당 필드에 넣는다.
					document.getElementById('postAddr').value = data.zonecode;
					document.getElementById("addr1").value = roadAddr;
					//                 document.getElementById("sample4_jibunAddress").value = data.jibunAddress;
				}
			}).open();
		}

		//서버페이지로 보낼 데이터 직렬화를 처리할 함수 valid()
		function valid() {

			event.preventDefault(); //이벤트(submit)의 기본 기능(지정된 action위치로 이동) 정지

			let formData = $('form').serialize();
			console.log(typeof data); //form안쪽 입력양식 요소들의 데이터 직렬화(urlendcoded형식 - key=value&k=v...)

			//AJAX를 통해 서버페이지로 직렬화된 데이터 전달하기(요청)
			$.ajax({
				type : 'post', //비밀번호 외 개인정보를 보내므로 post활용
				//url : 'serialize.jsp', //jsp
				url : '<%=request.getContextPath()%>/views/login/serialize.jsp', //jsp
				
				data : formData,
				success : function(result) {
					console.log(result);
					if (result == 1) {
						//가입성공시 로그인 페이지로 이동하기
						let conf = confirm("가입에 성공했습니다. 로그인 페이지로 이동할까요?");
						if (conf)
							location.href = "<%=request.getContextPath()%>/views/login/login.jsp";
						$('#joinspan').text("가입성공").css('color', 'gold');
						$('form *').val(""); //가입 직후 데이터 초기화
					} else {
						//가입실패
						$('#joinspan').text("가입실패").css('color', 'gray');
					}
				},
				error : function(xhr) {
					alert(xhr.status);
				}
			// 			,dataType: 'text' //jq는 넘어오는 정보의 타입에 맞춰 자동으로 받음
			});

		}

		function YnCheck(obj) {
			  var checked = obj.checked;
			  var valueToSend = checked ? "on" : "off";
			  obj.value = valueToSend;

			  // 체크하지 않았을 때 "off" 값을 전송
			  if (!checked) {
			    var hiddenInput = document.createElement("input");
			    hiddenInput.type = "hidden";
			    hiddenInput.name = "mem_noti";
			    hiddenInput.value = "off";
			    obj.parentNode.insertBefore(hiddenInput, obj.nextSibling);
			  } else {
			    // 체크한 경우에는 숨겨진 입력 필드 제거
			    var hiddenInput = obj.parentNode.querySelector("input[type=hidden][name=mem_noti]");
			    if (hiddenInput) {
			      hiddenInput.parentNode.removeChild(hiddenInput);
			    }
			  }
			}


		// join 페이지가 로드되면 "동의하지 않습니다." 라디오 버튼을 선택합니다.
		document.addEventListener("DOMContentLoaded", function() {
			var memberInfoYnNo = document.getElementById("memberInfoYnNo");
			memberInfoYnNo.checked = true;
			handleRadioChange(memberInfoYnNo);
		});
		document.addEventListener("DOMContentLoaded", function() {
			var provisionYnNo = document.getElementById("provisionYnNo");
			provisionYnNo.checked = true;
			handleRadioChange(provisionYnNo);
		});

		function handleRadioChange() {
			var memberInfoYnYes = document.getElementById("memberInfoYnYes");
			var provisionYnYes = document.getElementById("provisionYnYes");
			var joinBtn = document.getElementById("joinBtn");

			if (memberInfoYnYes.checked && provisionYnYes.checked) {
				joinBtn.disabled = false;
			} else {
				joinBtn.disabled = true;

			}
		}
	</script>
</body>
</html>
<%@include file="../../footer.jsp"%>
